
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707482293)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.ecs.aws_ecs_service.ecs_service
* Replace
  * module.ecs.aws_ecs_task_definition.ecs_task_definition


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura"
        name                               = "bined-hasura"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "HASURA_GRAPHQL_ENABLE_CONSOLE"
                            value = "true"
                        },
                      - {
                          - name  = "HASURA_GRAPHQL_JWT_SECRET"
                          - value = "{ \\\"type\\\": \\\"HS256\\\", \\\"key\\\": \\\"69f8fd4d54342b7ee3b0fcdf6def434c\\\" }"
                        },
                        {
                            name  = "HASURA_GRAPHQL_MAX_CACHE_SIZE"
                            value = "200"
                        },
                        # (3 unchanged elements hidden)
                    ]
                  - mountPoints      = []
                    name             = "bined-hasura"
                  + secrets          = [
                      + {
                          + name      = "HASURA_GRAPHQL_JWT_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-1:761817748648:secret:bined/hasura-graphql-jwt-secret-yI1yMH"
                        },
                    ]
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "bined-hasura" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":16,"Program":"tfcmt","SHA1":"7a3fab65704830889c60da337cd20ab5af1bf4ae","Vars":{},"WorkflowName":"Terraform"} -->